// 7. Reverse Integer
// 一开始想的是字符串操作,有点蠢,
// 10进制转换大概这种是正统?
// 没有一次AC, 理解错了溢出条件.
// happy path 写了多遍,  参考答案是把条件反过来写,就只要写一遍 实际操作,剩下的都是return 0, 可以参考一下.
// 负数取模会爆炸, 我刚试了python是非负剩余系 学到.
// leetcode 的c++ 做出来是先负,然后绝对值的非负剩余系,然后负回去
// 另外, 负数的比大小会和正的反大小于,也要注意
class Solution {
public:
    int reverse(int x) {
        int r = 0;
        // 123   0
        // 12    3
        //  1    32
        //  0    321

        while (x!= 0)
        {
            if (r>214748364 || r==214748364 && x>7)
            {
                return 0;
            }
            if (r< -214748364 || r == -214748364 && x<-8 )
            {
                return 0;
            }
       
            r = r*10 + x%10;
            x = x/10;
        }
        return r;
    }
};